{
  "basics": {
    "name": "Jason Kumpf",
    "label": "Developer",
    "picture": "",
    "email": "kumpf.jason@gmail.com",
    "phone": "(513) 685-0866",
    "website": "https://jasonkumpf.com",
    "summary": "Highly motivated and work well in teams.  Self starter mostly self taught in most areas especially technical. Find great value working on teams and have learned a great deal from all team members. Versatile and able to quickly adapt to new situations and environments. Good at maintaining focused and composure under severe pressure. Handled IT crisis situations keeping focused and calm until the situation was resolved.",
    "location": {
      "address": "13021 Old Stage Coach Rd. Apt 2511",
      "postalCode": "20708",
      "city": "Laurel",
      "countryCode": "US",
      "region": "MD"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "jasonpkumpf",
        "url": "https://twitter.com/jasonpkumpf"
      },
      {
        "network": "Github",
        "username": "contd",
        "url": "https://github.com/contd"
      }
    ]
  },
  "work": [
    {
      "company": "Roundtower",
      "position": "Desktop Support Admin",
      "website": "https://roundtower.com",
      "startDate": "March, 2019",
      "endDate": "Sept, 2019",
      "location": "Rockville, MD",
      "summary": "The client support services team needed a desktop support on-site lead for a customer and as a favor to the team lead who is my brother-in-law agreed to contract the position until they found a full time replacement. Responsibilities included supporting all aspects of building and maintaining IT equipment and over 300 employees at the client location (CNSI - Rockville, MD). Other responsibilities included data center equipment maintenance and monitoring."
    },
    {
      "company": "Senseye",
      "position": "Software Engineer",
      "website": "https://senseye.io",
      "startDate": "2017-11",
      "endDate": "2018-12",
      "location": "FUlly Remote (Southampton, UK)",
      "summary": "Worked with both customers and other developers to develop various tools and additions to the data ingestion pipeline, which fed the main product. Worked heavily on and with micro-services and AWS in a fast-paced, scrum driven, fully remote and very agile development team. Being remote for 90% of the team, communication and documentation was vital. During a transition of project management, my team began the switch to TypeScript and more sophisticated AWS/ECS integration for both testing and continuous integration."
    },
    {
      "company": "University of Cincinnati",
      "position": "Adjunct Faculty",
      "website": "http://www.uc.edu",
      "startDate": "2015-09",
      "endDate": "2016-05",
      "location": "Cincinnati, Ohio",
      "summary": "Full time adjunct faculty member (in the College of Education, Criminal Justice and Human Services IT Department) responsible for teaching courses on contemporary programming in C# and front-end web development. Other courses were network design and database design with SQL Server. Also responsible for advising senior capstone projects for 35 seniors through the course of their projects development."
    },
    {
      "company": "Academic Benchmarks",
      "position": "Senior Software Engineer",
      "website": "http://academicbenchmarks.com",
      "startDate": "2014-03",
      "endDate": "2014-11",
      "location": "Cincinnati, Ohio",
      "summary": "Participated in all phases of the software development lifecycle, including the architecture of solutions, creation of design documentation, actual coding and developing test plans. Provided multiple aspects to solve problems and coordinate team discussions to decide on the best solution not only for the given problem but, for potential larger issues. Helped to provide leadership to the team and mentor more junior developers. Brought a creative perspective to projects and/or solutions to problems so as to broaden the scope and determine other potential impacts throughout the product line and/or customers. Constantly stayed current on the latest technologies and best practices in web and software development and always looking for ways to improve the quality of the team and our development process."
    },
    {
      "company": "UC Infrastructure Institute",
      "position": "Research As. and Web/DB/Sys Admin",
      "website": "http://ceas.uc.edu/ucii",
      "startDate": "2008-09",
      "endDate": "2014-08",
      "location": "Cincinnati, Ohio",
      "summary": "Responsible for upgrading and converting the research group's web application for reporting the realtime status of various bridge monitors or monitoring of sensor data projects which included a realtime assessment of the general public's physical safety from potential harm due to certain weather conditions. (see Paper below). The systems grew as several new projects were taken on at the beginning and through the time spent there. Most projects involved pretty complex decision making and time critical scheduling often times over unreliable connections and several weather damaging events. Lead the group into rebuilding the whole system into a more robust and standardized solution from code down to methods for implementing new systems and new features."
    },
    {
      "company": "College of Applied Science at UC",
      "position": "Interim IT Director",
      "website": "http://ceas.uc.edu",
      "startDate": "2004-06",
      "endDate": "2008-08",
      "location": "Cincinnati, Ohio",
      "summary": "Started as Applications analyst developing and improving software developed for various custom aspects of the IT infrastructure and operations. Took over system administrative responsibilities of former employee managing IT infrastructure affecting 200+ employees and 5000+ students data and access to those IT resources. Became the Interim IT Director upon request of supervisor to perform the duties of another former employee responsible for managing the IT staff, support operations and computer classroom equipment. Managed $500,000 annual budget to support the 600+ computer systems, data center and staff salaries."
    },
    {
      "company": "College of Applied Science at UC",
      "position": "Applications Analyst",
      "website": "http://ceas.uc.edu",
      "startDate": "2004-06",
      "endDate": "2008-08",
      "location": "Cincinnati, Ohio",
      "summary": "Responsible for maintaining and supporting IT operations affected by both Victory Parkway and Clifton campus data centers and equipment. Operations affected include login of all CAS computer labs, faculty and staff office computer login and shared file access. Will provide constant monitoring of server and network performance to provide fault tolerance for critical applications and reduce redundancy of services/applications. Additional duties include the development of support materials (CMS or Technical knowledge, manuals, etc.), conducting occasional training sessions, moderate supervision of team members' projects and student workers."
    },
    {
      "company": "Scenario Learning",
      "position": "Programmer",
      "website": "http://saeschools.com",
      "startDate": "2002-10",
      "endDate": "2004-01",
      "location": "Cincinnati, Ohio",
      "summary": "In charge of developing a web application involving extensive Perl, XML, XSL, Apache, MySQL, and ActionScript knowledge. Current projects include developing an in-house SGML/XML document management system to be used to synchronize on-line documents with in-house documents. Came up with an easy solution to convert MS Word documents to SML/XML DocBook markup."
    },
    {
      "company": "Thinkronize - Knovation",
      "position": "Programmer",
      "website": "http://knovationlearning.com",
      "startDate": "2000-06",
      "endDate": "2002-10",
      "location": "Cincinnati, Ohio",
      "summary": "Determine system requirements by working with programming manager, product managers, and others as needed. Provide technical perspective to high-level design discussions. Develop system designs that effectively meet user requirements, efficiently operate, and effectively integrate with other systems. Develop and write software that operates efficiently and provides flexibility for future revisions. Fully test software and place into production. Resolve issues related to production software. Provide support for staff PCs and SunRay Workstations, including internal networking. Aid in development and support of internal software used daily by most of the staff which served the primary library or knowledge base for the company's product line and services."
    }
  ],
  "education": [
    {
      "institution": "University of Cincinnati",
      "area": "Information Engineering Technology",
      "studyType": "Bachelor of Science",
      "location": "Cincinnati, Ohio",
      "startDate": "Sept, 1999",
      "endDate": "June, 2001",
      "extras": [
        {
          "name": "Senior Capstone Project",
          "value": "Web-Based Virtual Laboratory (Content Management System)"
        }
      ]
    },
    {
      "institution": "University of Cincinnati",
      "area": "Mechanical Engineering Technology",
      "studyType": "Bachelor of Science",
      "location": "Cincinnati, Ohio",
      "startDate": "Sept, 1994",
      "endDate": "June, 2001",
      "extras": [
        {
          "name": "Senior Capstone Project",
          "value": "Automated Data Collection System for Heat Transfer Laboratory Experient"
        }
      ]
    },
    {
      "institution": "University of Cincinnati",
      "area": "Electrical Engineering",
      "studyType": "PhD - All But Dissertation",
      "location": "Cincinnati, Ohio",
      "startDate": "Sept, 2008",
      "endDate": "June, 2014",
      "extras": [
        {
          "name": "Relavant Coursework",
          "value": "Intelligent Systems, Multivariable Control, Stochastic Model"
        },
        {
          "name": "Research Topic",
          "value": "Calibration of Finite Element Models for Online Bridge Health Monitoring Systems"
        },
        {
          "name": "Additional",
          "value": "Completed the Preparing Future Faculty Training"
        }
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "Advanced",
      "keywords": [
        "Javascript",
        "Node.js",
        "Typescript",
        "Go",
        "Perl",
        "Php",
        "Python",
        "C,C++",
        "C#"
      ]
    },
    {
      "name": "Linux System Admin",
      "level": "Advanced",
      "keywords": [
        "Linux",
        "Debian",
        "Ubuntu",
        "Arch",
        "Fedora",
        "CentOS",
        "RHEL",
        "Unix",
        "BSD",
        "Solaris",
        "FreeBSD",
        "Darwin/OSX/macOS",
        "Windows (NT4 - Windows 10/Server 2016)"
      ]
    },
    {
      "name": "DevOps",
      "level": "Advanced",
      "keywords": [
        "AWS",
        "Docker",
        "Kubernetes",
        "Vagrant",
        "GCE",
        "DigitalOcean",
        "VMWare",
        "VirtualBox",
        "KVM",
        "Advanced Networking"
      ]
    },
    {
      "name": "Embedded Development",
      "level": "Intermediate",
      "keywords": [
        "Arduono",
        "PIC",
        "Raspberry Pi",
        "MIPS",
        "Freescale",
        "mbed",
        "BeagleBone",
        "Yocto",
        "MicroPython",
        "Zigbee",
        "Zwave"
      ]
    },
    {
      "name": "Database Systems",
      "level": "Intermediate",
      "keywords": [
        "MySQL",
        "MariaDB",
        "Mongodb",
        "Postgres",
        "Redis",
        "Influx",
        "SQLite",
        "DB2",
        "MSSQL Server"
      ]
    },
    {
      "name": "Web Design",
      "level": "Advanced",
      "keywords": [
        "HTML5",
        "CSS3",
        "Adobe Photoshop",
        "Adobe Illistrator",
        "GIMP",
        "Inkscape",
        "Sketch",
        "Affinity Designer"
      ]
    }
  ],
  "publications": [
    {
      "authors": "Kumpf, J., Helmicki, A., Nims, D., Hunt, V., and Agrawal, S.",
      "year": "2012",
      "title": "Automated Ice Inference and Monitoring on the Veterans' Glass City Skyway Bridge",
      "publication": "J. Bridge Eng. 17, SPECIAL ISSUE: Nondestructive Evaluation and Testing for Bridge Inspection and Evaluation",
      "pages": "975-978",
      "publisher": "ASCE Journal of Bridge Engieering",
      "releaseDate": "2012-01-01",
      "website": "http://ascelibrary.org/doi/abs/10.1061/(ASCE)BE.1943-5592.0000365",
      "website2": "http://www.researchgate.net/publication/257921037_Automated_Ice_Inference_and_Monitoring_on_the_Veterans_Glass_City_Skyway_Bridge",
      "summary": "Under certain weather conditions, the Veterans’ Glass City Skyway (VGCS) Bridge in Toledo, Ohio, accumulates ice on the stay sheaths in such a way that has led to large fragments falling into traffic lanes. To aid the Ohio Department of Transportation (ODOT) in their response to this, an automatic inference and monitoring system was implemented. This system utilizes existing weather station measurement data to infer possible events, alerting officials and providing tools to further assess the situation. The development of the decision, the algorithm, and implementation process are presented. The system was implemented in January 2011, and it warned of and monitored an icing event that occurred February 20–24, 2011. Ice fell shortly after the system indicated conditions were met for icefall. ODOT personnel used the ice inference system to assist them in managing the response to the icing event.   Read More: http://ascelibrary.org/doi/abs/10.1061/(ASCE)BE.1943-5592.0000365"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": [
        "Camping",
        "Hiking",
        "Mountain Biking"
      ]
    }
  ]
}
